// 1) Використовуючи оператор "Рівності (==)" порівняйте два значення так, щоб в першому випадку ви отримали "false"
// а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 2, b = 3;
a == b;
console.log(a == b);

let a = 2, b = a;
a == b;
console.log(a == b);

// 2) Використовуючи оператор "Нерівності (!=)" порівняйте два значення так, щоб в першому випадку ви отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let c = 2, d = 2;
c != d;
console.log(c != d);

let c = 2, d = 3;
c != d;
console.log(c != d);

// 3) Використовуючи оператор "Строгої рівності (===)" порівняйте два значення так, щоб в першому випадку ви 
// отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 2, b = 3;
a === b;
console.log(a === b);

let a = 2, b = a;
a === b;
console.log(a === b);

// 4) Використовуючи оператор "Строгої нерівності (!==)" порівняйте два значення так, щоб в першому випадку ви 
// отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let c = 2, d = 2;
c !== d;
console.log(c !== d);

let c = 2, d = 3;
c !== d;
console.log(c !== d);

// 5) Використовуючи оператор "Більше ніж (>)" порівняйте два значення так, щоб в першому випадку ви отримали 
// "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let c = 2, d = 2;
c > d;
console.log(c > d);

let c = 2, d = 1;
c > d;
console.log(c > d);

// 6) Використовуючи оператор "Більше чи дорівнює (>=)" порівняйте два значення так, щоб в першому випадку ви
// отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 2, b = '3';
a >= b;
console.log(a >= b);

let a = 2, b = 3;
b >= a;
console.log(b >= a);

// 7) Використовуючи оператор "Менше ніж (<)" порівняйте два значення так, щоб в першому випадку ви отримали 
// "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 2, b = '3';
b < a;
console.log(b < a);

let a = 2, b = '3';
a < b
console.log(a < b);

// 8) Використовуючи оператор "Менше чи дорівнює (<=)" порівняйте два значення так, щоб в першому випадку ви 
// отримали "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let a = 2, b = '3';
b <= a;
console.log(b <= a);

let a = 2, b = '3';
a <= b
console.log(a <= b);

// 9) Використовуючи оператор "Логічне І (&&)" порівняйте два значення так, щоб в першому випадку ви отримали "false" 
// а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let x = 5, y = 10;
x === 6 && y === 10;
console.log(x === 6 && y === 10); // виведе false


let x = 5, y = 10;
x === 5 && y === 10;
console.log(x === 5 && y === 10); // виведе true

// 10) Використовуючи оператор "Логічне АБО (||)" порівняйте два значення так, щоб в першому випадку ви отримали 
// "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

let x = 5, y = 10;
x === 6 || y === 10;
console.log(x === 6 && y === 10); // виведе true

let x = 5, y = 10;
x === 6 || y === 7;
console.log(x === 6 && y === 10); // виведе false

// 11) Використовуючи оператор "Логічне НЕ (!)" порівняйте два значення так, щоб в першому випадку ви отримали 
// "false" а в другому випадку "true".
// * Виведіть результат порівняння в консоль за допомогою "console.log"

    let myVar = 'gggg';
    console.log(!myVar);
    console.log(!!myVar);

    /* правду кажучи я не розумію, що тут потрібно порівнювати, якщо логічне Ні (!) лише перетворює значення змінної у тип Boolean, 
     а потім перетворює його на протилежне за типом значення. Що із чим потрібно порівнювати? */

// 12) Використовуючи оператор "Рядкове додавання (+)" додайте два значення типу "string".
// * Виведіть результат в консоль за допомогою "console.log"

let ss = "Stepan ", mm = 'Uhryn';
let nn = ss + mm;
console.log(nn);

// 13) За допомогою тернарного оператору присвойте значення у змінну "type" використовуючи змінну "color". Якщо колір
// дорівнює "червоний", тоді значення змінної має бути "пожежна" інакше "медична".
// * Виведіть "type" в консоль за допомогою "console.log". Зробіть два варіанти в одному резyльтат в консолі має бути
// "пожежна" в іншому "медична"

let color = 'red';
let type = (color === 'red') ? 'пожежна' : 'медична';
console.log(type);
//пожежна

let color = 'green';
let type = (color === 'red') ? 'пожежна' : 'медична';
console.log(type);
// медична

// 14) Створіть об'єкт з довільними ключами і видаліть довільний ключ за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"

let obj = {key1: 'x', key2: '2y', key3: 55, key4: true };
delete obj.key2;
console.log(obj);

// 15) Створіть масив з довільними значеннями і видаліть довільне значення за допомогою оператору "delete"
// * Виведіть результат в консоль за допомогою "console.log"

let array = ['affff', 'ggggg', 56, false, function () {}];
delete array[0];
delete array[4];
console.log(array); //Виводить на консоль -  (5) [empty, "ggggg", 56, false, empty]

// 16) Створіть об'єкт з довільними ключами і за допомогою оператору "in" визначіть наявність ключів у об'єкті. 
// Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"

let person = {
        name: "Peter",
        age: 28,
        gender: "Male",
    };
    'name' in person; // видає true
    console.log('name' in person);

    let person = {
        name: "Peter",
        age: 28,
        gender: "Male",
    };
    'firstname' in person; // видає false
console.log('firstname' in person);

// 16) Створіть масив з довільними значеннями і за допомогою оператору "in" визначіть наявність значення у масиві. 
Одне значення повинно бути наявне а інше повинно бути відсутнє
// * Виведіть результат в консоль за допомогою "console.log"

let array = [2, 5, 8, -2, 'kkkkll', true, function () {}];
0 in array; // перше значення масиву - 2
7 in array; // восьмого порядкового номеру не існує
console.log(0 in array);
console.log(7 in array);