let expr = ['Апельсини','Яблука','Банани','Вишні','Манго','Папайя'];
switch (expr) {
  case expr = 'Апельсини': {
alert('Апельсини коштують $0.59 за фунт.');    
// console.log('Апельсини коштують $0.59 за фунт.');
    break;
} 
case 'Яблука': {
alert('Яблука коштують $0.59 за фунт.');    
//console.log('Яблука коштують $0.32 за фунт.');
    break;
}  
case 'Банани': {
   alert('Банани коштують $0.59 за фунт.');
 //console.log('Банани коштують $0.48 за фунт.');
    break;
}
  case 'Вишні': {
alert('Вишні коштують $0.59 за фунт.');    
//console.log('Вишні коштують $3.00 за фунт.');
    break;
  }
  case 'Манго': {
  // case 'Папайя':
alert('Манго та папайя коштують $2.79 за фунт.');  
//  console.log('Манго та папайя коштують $2.79 за фунт.');
    break;
  } 
 default:
  alert('Вибачте, в нас закінчились ' + expr + '.');  
//console.log('Вибачте, в нас закінчились ' + expr + '.');
}
alert('Бажаєте чого-небудь ще?');
//console.log("Бажаєте чого-небудь ще?");